; domain
(define (domain zum-du3-kouzelny-svet)
    (:requirements :strips :typing)
    (:types
        ; --- META TYPES ---
        objekt
        lokace
        stvoreni - objekt
        vec - objekt

        ; --- NORMAL TYPES ---
        clovek - stvoreni
        medved - stvoreni

        akademie - lokace
        hospoda - lokace
        mesto - lokace
        more - lokace
        pristav - lokace
        les - lokace
        reka - lokace
        ostrov - lokace
        majak - lokace

        voda - vec
        drevo - vec
        kvetina - vec
        prstynek - vec
        perla - vec
        mapa - vec
        alkohol - vec
        kokain - vec
        zlate-zrnko - vec
        zlata-mince - vec
        zlata-cihla - vec

        zbozi - vec
        kokos - zbozi
        kuze - zbozi

        lod - vec
        clun - lod
        fregata - lod
        karavela - lod
    )

    (:predicates
        (existuje-cesta ?lokace-1 - lokace ?lokace-2 - lokace)
        (existuje-cesta-morem ?lokace-1 - lokace ?lokace-2 - lokace)

        (nachazi-se ?objekt - objekt ?lokace - lokace)
        (vlastni ?clovek - clovek ?vec - vec)

        (ma-zaznam-v-rejstriku-trestu ?clovek - clovek)
        (ma-dobre-znamosti ?clovek - clovek)
        (ma-pochybne-znamosti ?clovek - clovek)
        (ma-znamosti-s-paseraky ?clovek - clovek)
        (ma-porazene-piraty ?clovek - clovek)
        (ma-oslnenou-divku ?clovek - clovek)
        (je-zocelen ?clovek - clovek)
        (je-nameteny ?clovek - clovek)
        (je-opily ?clovek - clovek)
        (je-zavisly-na-alkoholu ?clovek - clovek)
        (je-zasnoubeny-s-divkou ?clovek - clovek)
        (je-kapitanem ?clovek - clovek)
        (je-stastny1 ?clovek - clovek)
        (je-stastny2 ?clovek - clovek)
        (je-stastny3 ?clovek - clovek)

        (je-stastny ?clovek - clovek)
    )

    ; POHYB ATD --------------------------------------------------------------------------

    (:action sel
        :parameters (?clovek - clovek ?lokace-1 - lokace ?lokace-2 - lokace)
        :precondition (and
            (nachazi-se ?clovek ?lokace-1)
            (existuje-cesta ?lokace-1 ?lokace-2)
        )
        :effect (and
            (nachazi-se ?clovek ?lokace-2)
            (not (nachazi-se ?clovek ?lokace-1))
        )
    )

    (:action plul
        :parameters (?clovek - clovek ?lod - lod ?lokace-1 - lokace ?lokace-2 - lokace)
        :precondition (and
            (nachazi-se ?clovek ?lokace-1)
            (existuje-cesta-morem ?lokace-1 ?lokace-2)
            (vlastni ?clovek ?lod)
            (je-zocelen ?clovek)
        )
        :effect (and
            (nachazi-se ?clovek ?lokace-2)
            (not (nachazi-se ?clovek ?lokace-1))
        )
    )

    (:action ziskal
        :parameters (?clovek - clovek ?vec - vec ?lokace - lokace)
        :precondition (and
            (nachazi-se ?clovek ?lokace)
            (nachazi-se ?vec ?lokace)
        )
        :effect (and
            (vlastni ?clovek ?vec)
        )
    )


    ; PENIZE ------------------------------------------------------------------------------------------

    (:action pracoval
        :parameters (?clovek - clovek ?zlate-zrnko - zlate-zrnko ?pristav - pristav)
        :precondition (and
            (nachazi-se ?clovek ?pristav)
        )
        :effect (and
            (vlastni ?clovek ?zlate-zrnko)
        )
    )

    (:action ryzoval-zlato
        :parameters (?clovek - clovek ?zlate-zrnko - zlate-zrnko ?reka - reka)
        :precondition (and
            (nachazi-se ?clovek ?reka)
        )
        :effect (and
            (vlastni ?clovek ?zlate-zrnko)
        )
    )

    (:action prodal
        :parameters (?clovek - clovek ?zbozi - zbozi ?pristav - pristav ?zlata-mince - zlata-mince)
        :precondition (and
            (nachazi-se ?clovek ?pristav)
            (vlastni ?clovek ?zbozi)
        )
        :effect (and
            (not (vlastni ?clovek ?zbozi))
            (vlastni ?clovek ?zlata-mince)
        )
    )

    (:action stradal
        :parameters (?clovek - clovek ?zlate-zrnko - zlate-zrnko ?zlata-mince - zlata-mince ?mesto - mesto)
        :precondition (and
            (vlastni ?clovek ?zlate-zrnko)
            (nachazi-se ?clovek ?mesto)
        )
        :effect (and
            (vlastni ?clovek ?zlata-mince)
            (not (vlastni ?clovek ?zlate-zrnko))
            (ma-dobre-znamosti ?clovek)
        )
    )

    (:action investoval
        :parameters (?clovek - clovek ?zlata-mince - zlata-mince ?zlata-cihla - zlata-cihla ?mesto - mesto)
        :precondition (and
            (vlastni ?clovek ?zlata-mince)
            (nachazi-se ?clovek ?mesto)
        )
        :effect (and
            (vlastni ?clovek ?zlata-cihla)
            (not (vlastni ?clovek ?zlata-mince))
            (ma-dobre-znamosti ?clovek)
        )
    )

    (:action pustil-se-do-zlodejiny
        :parameters (?clovek - clovek ?zlata-mince - zlata-mince ?mesto - mesto)
        :precondition (and (nachazi-se ?clovek ?mesto))
        :effect (and
            (vlastni ?clovek ?zlata-mince)
            (ma-zaznam-v-rejstriku-trestu ?clovek)
        )
    )

    ; ALKOHOL -------------------------------------------------------------------------------

    (:action koupil-alkohol
        :parameters (?clovek - clovek ?alkohol - alkohol ?zlate-zrnko - zlate-zrnko ?hospoda - hospoda)
        :precondition (and
            (nachazi-se ?clovek ?hospoda)
            (vlastni ?clovek ?zlate-zrnko)
        )
        :effect (and
            (not (vlastni ?clovek ?zlate-zrnko))
            (vlastni ?clovek ?alkohol)
        )
    )

    (:action dal-si-panaka
        :parameters (?clovek - clovek ?alkohol - alkohol)
        :precondition (and (vlastni ?clovek ?alkohol))
        :effect (and
            (je-nameteny ?clovek)
            (not (vlastni ?clovek ?alkohol))
        )
    )

    (:action opil-se
        :parameters (?clovek - clovek ?alkohol - alkohol)
        :precondition (and (vlastni ?clovek ?alkohol) (je-nameteny ?clovek))
        :effect (and
            (je-opily ?clovek)
            (not (je-nameteny ?clovek))
            (not (vlastni ?clovek ?alkohol))
        )
    )

    (:action opil-se-a-ziskal-alkozavislost
        :parameters (?clovek - clovek ?alkohol - alkohol)
        :precondition (and
            (vlastni ?clovek ?alkohol)
            (je-opily ?clovek)
        )
        :effect (and
            (je-zavisly-na-alkoholu ?clovek)
            (not (je-opily ?clovek))
            (not (vlastni ?clovek ?alkohol))
        )
    )

    (:action dopral-si-ledovou-koupel-a-vystrizlivel
        :parameters (?clovek - clovek ?lokace - lokace ?voda - voda)
        :precondition (and
            (nachazi-se ?voda ?lokace)
            (nachazi-se ?clovek ?lokace)
        )
        :effect (and
            (not (je-nameteny ?clovek))
            (not (je-opily ?clovek))
        )
    )

    ; LODE ---------------------------------------------------------------------------------

    (:action ukradl-clun
        :parameters (?clovek - clovek ?clun - clun ?reka - reka)
        :precondition (and
            (nachazi-se ?clovek ?reka)
        )
        :effect (and
            (vlastni ?clovek ?clun)
            (ma-zaznam-v-rejstriku-trestu ?clovek)
        )
    )

    (:action vytvoril-clun
        :parameters (?clovek - clovek ?clun - clun ?drevo - drevo)
        :precondition (and (vlastni ?clovek ?drevo))
        :effect (and
            (not (vlastni ?clovek ?drevo))
            (vlastni ?clovek ?clun)
        )
    )

    (:action sehnal-fregatu
        :parameters (?clovek - clovek ?fregata - fregata ?clun - clun ?drevo - drevo ?zlate-zrnko - zlate-zrnko)
        :precondition (and
            (vlastni ?clovek ?clun)
            (vlastni ?clovek ?drevo)
            (vlastni ?clovek ?zlate-zrnko)
        )
        :effect (and
            (not (vlastni ?clovek ?clun))
            (not (vlastni ?clovek ?drevo))
            (not (vlastni ?clovek ?zlate-zrnko))
            (vlastni ?clovek ?fregata)
        )
    )

    (:action sehnal-karavelu
        :parameters (?clovek - clovek ?karavela - karavela ?clun - clun ?drevo - drevo ?zlata-mince - zlata-mince)
        :precondition (and
            (vlastni ?clovek ?clun)
            (vlastni ?clovek ?drevo)
            (vlastni ?clovek ?zlata-mince)
        )
        :effect (and
            (not (vlastni ?clovek ?clun))
            (not (vlastni ?clovek ?drevo))
            (not (vlastni ?clovek ?zlata-mince))
            (vlastni ?clovek ?karavela)
        )
    )

    ; NEJAKA DALSI LOGIKA -------------------------------------------------------------------------------

    (:action vymenil-alkohol-za-mapu
        :parameters (?clovek - clovek ?kouzelny-dedecek - clovek ?alkohol - alkohol ?mapa - mapa ?les - les)
        :precondition (and
            (nachazi-se ?kouzelny-dedecek ?les)
            (vlastni ?kouzelny-dedecek ?mapa)
            (nachazi-se ?clovek ?les)
            (vlastni ?clovek ?alkohol)
        )
        :effect (and
            (ma-pochybne-znamosti ?clovek)
            (vlastni ?clovek ?mapa)
            (not (vlastni ?clovek ?alkohol))
        )
    )

    (:action vybral-skrys
        :parameters (?clovek - clovek ?kokain - kokain ?mapa - mapa ?ostrov - ostrov)
        :precondition (and
            (nachazi-se ?clovek ?ostrov)
            (vlastni ?clovek ?mapa)
        )
        :effect (and
            (vlastni ?clovek ?kokain)
            (not (vlastni ?clovek ?mapa))
        )
    )

    ; VZTAHY ---------------------------------------------------------------------------

    (:action seznamil-se-s-paseraky
        :parameters (?clovek - clovek ?zlata-cihla - zlata-cihla ?pristav - pristav)
        :precondition (and
            (ma-pochybne-znamosti ?clovek)
            (nachazi-se ?clovek ?pristav)
            (vlastni ?clovek ?zlata-cihla)
        )
        :effect (and
            (ma-znamosti-s-paseraky ?clovek)
        )
    )

    (:action napadli-pirati
        :parameters (
            ?clovek - clovek
            ?more - more
            ?zlate-zrnko - zlate-zrnko
            ?zlata-mince - zlata-mince
            ?zlata-cihla - zlata-cihla
            ?fregata - fregata
            ?karavela - karavela
        )
        :precondition (and
            (nachazi-se ?clovek ?more)
            (not (je-zocelen ?clovek))
        )
        :effect (and
            (je-zocelen ?clovek)
            (not (vlastni ?clovek ?zlate-zrnko))
            (not (vlastni ?clovek ?zlata-mince))
            (not (vlastni ?clovek ?zlata-cihla))
            (not (vlastni ?clovek ?fregata))
            (not (vlastni ?clovek ?karavela))
        )
    )

    (:action pridal-se-k-piratum
        :parameters (?clovek - clovek ?more - more)
        :precondition (and
            (nachazi-se ?clovek ?more)
            (ma-pochybne-znamosti ?clovek)
        )
        :effect (and (je-nameteny ?clovek))
    )

    (:action zaplatil-rundu
        :parameters (?clovek - clovek ?zlata-mince - zlata-mince ?hospoda - hospoda ?alkohol - alkohol)
        :precondition (and
            (nachazi-se ?clovek ?hospoda)
            (vlastni ?clovek ?zlata-mince)
        )
        :effect (and
            (vlastni ?clovek ?alkohol)
            (ma-dobre-znamosti ?clovek)
            (not (vlastni ?clovek ?zlata-mince))
        )
    )

    (:action koupil-si-odpustek
        :parameters (?clovek - clovek ?mesto - mesto ?zlate-zrnko - zlate-zrnko)
        :precondition (and
            (nachazi-se ?clovek ?mesto)
            (ma-zaznam-v-rejstriku-trestu ?clovek)
            (vlastni ?clovek ?zlate-zrnko)
        )
        :effect (and
            (not (ma-zaznam-v-rejstriku-trestu ?clovek))
            (not (vlastni ?clovek ?zlate-zrnko))
        )
    )

    (:action venoval-se-verejnym-pracim
        :parameters (?clovek - clovek ?mesto - mesto)
        :precondition (and
            (nachazi-se ?clovek ?mesto)
            (ma-zaznam-v-rejstriku-trestu ?clovek)
        )
        :effect (and
            (not (ma-zaznam-v-rejstriku-trestu ?clovek))
            (je-nameteny ?clovek)
        )
    )

    (:action vystudoval-akademii-a-stal-se-kapitanem
        :parameters (?clovek - clovek ?zlata-mince - zlata-mince ?akademie - akademie)
        :precondition (and
            (vlastni ?clovek ?zlata-mince)
            (nachazi-se ?clovek ?akademie)
        )
        :effect (and
            (not (vlastni ?clovek ?zlata-mince))
            (je-kapitanem ?clovek)
            (ma-oslnenou-divku ?clovek)
        )
    )

    ; OSLNENI ATD ------------------------------------------------------------------------------

    (:action porval-se-s-medvedem
        :parameters (?clovek - clovek ?medved - medved ?les - les ?kuze - kuze)
        :precondition (and
            (nachazi-se ?clovek ?les)
            (nachazi-se ?medved ?les)
        )
        :effect (and
            (vlastni ?clovek ?kuze)
            (je-zocelen ?clovek)
            (ma-oslnenou-divku ?clovek)
        )
    )

    (:action zocelil-se-v-bitce-v-hospode
        :parameters (?clovek - clovek ?hospoda - hospoda)
        :precondition (and
            (nachazi-se ?clovek ?hospoda)
            (je-nameteny ?clovek)
        )
        :effect (and
            (je-zocelen ?clovek)
        )
    )

    (:action porazil-piraty
        :parameters (
            ?clovek - clovek
            ?more - more
            ?karavela - karavela
            ?clun - clun
            ?fregata - fregata
            ?zlate-zrnko - zlate-zrnko
            ?zlata-mince - zlata-mince
            ?zlata-cihla - zlata-cihla
        )
        :precondition (and
            (je-zocelen ?clovek)
            (vlastni ?clovek ?karavela)
            (nachazi-se ?clovek ?more)
        )
        :effect (and
            (ma-porazene-piraty ?clovek)
            (ma-oslnenou-divku ?clovek)
            (vlastni ?clovek ?clun)
            (vlastni ?clovek ?fregata)
            (vlastni ?clovek ?zlate-zrnko)
            (vlastni ?clovek ?zlata-mince)
            (vlastni ?clovek ?zlata-cihla)
        )
    )

    (:action sehnal-prstynek
        :parameters (?clovek - clovek ?prstynek - prstynek ?zlata-cihla - zlata-cihla ?perla - perla)
        :precondition (and
            (vlastni ?clovek ?zlata-cihla)
            (vlastni ?clovek ?perla)
        )
        :effect (and
            (vlastni ?clovek ?prstynek)
            (not (vlastni ?clovek ?zlata-cihla))
            (not (vlastni ?clovek ?perla))
        )
    )

    (:action donesl-divce-prstynek-a-kvetinu
        :parameters (?clovek - clovek ?divka - clovek ?kvetina - kvetina ?prstynek - prstynek ?majak - majak)
        :precondition (and
            (ma-oslnenou-divku ?clovek)
            (vlastni ?clovek ?kvetina)
            (vlastni ?clovek ?prstynek)
            (nachazi-se ?clovek ?majak)
        )
        :effect (and
            (je-zasnoubeny-s-divkou ?clovek)
        )
    )

    ; -------------------------------------------
    ;               FINAL
    ; -------------------------------------------

    (:action ozenil-se
        :parameters (?clovek - clovek ?kvetina - kvetina ?prstynek - prstynek ?ostrov - ostrov)
        :precondition (and
            (je-zasnoubeny-s-divkou ?clovek)
            (ma-dobre-znamosti ?clovek)
            (not (ma-zaznam-v-rejstriku-trestu ?clovek))
            (not (je-opily ?clovek))
            (not (je-zavisly-na-alkoholu ?clovek))
            (nachazi-se ?clovek ?ostrov)
        )
        :effect (and
            (je-stastny1 ?clovek)
            (je-stastny ?clovek)
        )
    )

    (:action stal-se-admiralem
        :parameters (?clovek - clovek ?akademie - akademie)
        :precondition (and
            (je-kapitanem ?clovek)
            (ma-porazene-piraty ?clovek)
            (nachazi-se ?clovek ?akademie)
            (not (je-nameteny ?clovek))
            (not (je-opily ?clovek))
            (not (je-zavisly-na-alkoholu ?clovek))
        )
        :effect (and
            (je-stastny2 ?clovek)
            (je-stastny ?clovek)
        )
    )

    (:action dal-se-na-kokain
        :parameters (?clovek - clovek ?kokain - kokain ?zlata-cihla - zlata-cihla ?fregata - fregata)
        :precondition (and
            (vlastni ?clovek ?kokain)
            (ma-znamosti-s-paseraky ?clovek)
            (vlastni ?clovek ?zlata-cihla)
            (vlastni ?clovek ?fregata)
            (je-zavisly-na-alkoholu ?clovek)
        )
        :effect (and
            (je-stastny3 ?clovek)
            (je-stastny ?clovek)
        )
    )
)

; problem
(define (problem hledani-stesti)
    (:domain zum-du3-kouzelny-svet)
    (:requirements :strips :typing)

    (:objects
        ; --- LOKACE ---
        nejaka-akademie - akademie
        nejaky-les - les
        nejake-mesto - mesto
        nejaky-ostrov - ostrov
        nejaky-pristav - pristav
        nejake-more - more
        nejaka-hospoda - hospoda
        nejaka-reka - reka
        nejaky-majak - majak

        ; --- STVORENI ---
        namornik - clovek
        divka - clovek
        kouzelny-dedecek - clovek
        nejaky-medved - medved

        ; --- VECI ---
        nejaka-voda - voda
        nejake-drevo - drevo
        nejaka-kvetina - kvetina
        nejaky-prstynek - prstynek
        nejaka-perla - perla
        nejake-kokosy - kokos
        medvedi-kuze - kuze
        nejaky-clun - clun
        nejaka-fregata - fregata
        nejaka-karavela - karavela
        nejake-zlate-zrnko - zlate-zrnko
        nejaka-zlata-mince - zlata-mince
        nejaka-zlata-cihla - zlata-cihla
        nejaka-mapa - mapa
        nejaky-kokain - kokain
        nejaky-alkohol - alkohol
    )

    (:init
        (nachazi-se namornik nejaky-pristav)

        ; --- CESTY ---
        (existuje-cesta nejaky-les nejaka-reka) (existuje-cesta nejaka-reka nejaky-les)
        (existuje-cesta nejaky-pristav nejaka-reka) (existuje-cesta nejaka-reka nejaky-pristav)
        (existuje-cesta nejaky-pristav nejaka-hospoda) (existuje-cesta nejaka-hospoda nejaky-pristav)
        (existuje-cesta nejaky-pristav nejake-mesto) (existuje-cesta nejake-mesto nejaky-pristav)
        (existuje-cesta nejake-mesto nejaka-akademie) (existuje-cesta nejaka-akademie nejake-mesto)

        ; --- CESTY MOREM ---
        (existuje-cesta-morem nejaky-pristav nejake-more) (existuje-cesta-morem nejake-more nejaky-pristav)
        (existuje-cesta-morem nejake-more nejaky-ostrov) (existuje-cesta-morem nejaky-ostrov nejake-more)
        (existuje-cesta-morem nejake-more nejaky-majak) (existuje-cesta-morem nejaky-majak nejake-more)
        (existuje-cesta-morem nejaky-pristav nejaky-majak) (existuje-cesta-morem nejaky-majak nejaky-pristav)

        ; --- LES ---
        (nachazi-se nejaka-kvetina nejaky-les)
        (nachazi-se nejake-drevo nejaky-les)
        (nachazi-se nejaky-medved nejaky-les)
        (nachazi-se kouzelny-dedecek nejaky-les)
        (vlastni kouzelny-dedecek nejaka-mapa)

        ; --- REKA ---
        (nachazi-se nejaka-voda nejaka-reka)
        (nachazi-se nejake-zlate-zrnko nejaka-reka)

        ; --- PRISTAV ---
        (nachazi-se nejake-zlate-zrnko nejaky-pristav)

        ; --- HOSPODA ---

        ; --- MESTO ---

        ; --- AKADEMIE ---

        ; --- MORE ---
        (nachazi-se nejaka-voda nejake-more)
        (nachazi-se nejaka-perla nejake-more)

        ; --- MAJAK ---
        (nachazi-se divka nejaky-majak)

        ; --- OSTROV ---
        (nachazi-se nejake-drevo nejaky-ostrov)
        (nachazi-se nejake-kokosy nejaky-ostrov)
    )

    (:goal (and
            (je-stastny1 namornik)
            (je-stastny2 namornik)
            (je-stastny3 namornik)

            ; je-stastny1 NEBO je-stastny2 NEBO je-stastny3 (nejrychlejsi reseni)
            ; (je-stastny namornik)
        )
    )
)

; plan
1. (pracoval namornik nejake-zlate-zrnko nejaky-pristav)
   added: (vlastni namornik nejake-zlate-zrnko)
   goals met: 0 of 3
2. (sel namornik nejaky-pristav nejaka-hospoda)
   deleted: (nachazi-se namornik nejaky-pristav)
   added: (nachazi-se namornik nejaka-hospoda)
   goals met: 0 of 3
3. (koupil-alkohol namornik nejaky-alkohol nejake-zlate-zrnko nejaka-hospoda)
   deleted: (vlastni namornik nejake-zlate-zrnko)
   added: (vlastni namornik nejaky-alkohol)
   goals met: 0 of 3
4. (sel namornik nejaka-hospoda nejaky-pristav)
   deleted: (nachazi-se namornik nejaka-hospoda)
   added: (nachazi-se namornik nejaky-pristav)
   goals met: 0 of 3
5. (sel namornik nejaky-pristav nejaka-reka)
   deleted: (nachazi-se namornik nejaky-pristav)
   added: (nachazi-se namornik nejaka-reka)
   goals met: 0 of 3
6. (sel namornik nejaka-reka nejaky-les)
   deleted: (nachazi-se namornik nejaka-reka)
   added: (nachazi-se namornik nejaky-les)
   goals met: 0 of 3
7. (vymenil-alkohol-za-mapu namornik kouzelny-dedecek nejaky-alkohol nejaka-mapa nejaky-les)
   deleted: (vlastni namornik nejaky-alkohol)
   added: (ma-pochybne-znamosti namornik) (vlastni namornik nejaka-mapa)
   goals met: 0 of 3
8. (ziskal namornik nejaka-kvetina nejaky-les)
   added: (vlastni namornik nejaka-kvetina)
   goals met: 0 of 3
9. (porval-se-s-medvedem namornik nejaky-medved nejaky-les medvedi-kuze)
   added: (vlastni namornik medvedi-kuze) (je-zocelen namornik) (ma-oslnenou-divku namornik)
   goals met: 0 of 3
10. (ziskal namornik nejake-drevo nejaky-les)
   added: (vlastni namornik nejake-drevo)
   goals met: 0 of 3
11. (sel namornik nejaky-les nejaka-reka)
   deleted: (nachazi-se namornik nejaky-les)
   added: (nachazi-se namornik nejaka-reka)
   goals met: 0 of 3
12. (ukradl-clun namornik nejaky-clun nejaka-reka)
   added: (vlastni namornik nejaky-clun) (ma-zaznam-v-rejstriku-trestu namornik)
   goals met: 0 of 3
13. (sel namornik nejaka-reka nejaky-pristav)
   deleted: (nachazi-se namornik nejaka-reka)
   added: (nachazi-se namornik nejaky-pristav)
   goals met: 0 of 3
14. (prodal namornik medvedi-kuze nejaky-pristav nejaka-zlata-mince)
   deleted: (vlastni namornik medvedi-kuze)
   added: (vlastni namornik nejaka-zlata-mince)
   goals met: 0 of 3
15. (plul namornik nejaky-clun nejaky-pristav nejake-more)
   deleted: (nachazi-se namornik nejaky-pristav)
   added: (nachazi-se namornik nejake-more)
   goals met: 0 of 3
16. (ziskal namornik nejaka-perla nejake-more)
   added: (vlastni namornik nejaka-perla)
   goals met: 0 of 3
17. (sehnal-karavelu namornik nejaka-karavela nejaky-clun nejake-drevo nejaka-zlata-mince)
   deleted: (vlastni namornik nejaky-clun) (vlastni namornik nejake-drevo) (vlastni namornik nejaka-zlata-mince)
   added: (vlastni namornik nejaka-karavela)
   goals met: 0 of 3
18. (porazil-piraty namornik nejake-more nejaka-karavela nejaky-clun nejaka-fregata nejake-zlate-zrnko nejaka-zlata-mince nejaka-zlata-cihla)
   added: (ma-porazene-piraty namornik) (vlastni namornik nejaky-clun) (vlastni namornik nejaka-fregata) (vlastni namornik nejake-zlate-zrnko) (vlastni namornik nejaka-zlata-mince) (vlastni namornik nejaka-zlata-cihla)
   goals met: 0 of 3
19. (plul namornik nejaka-karavela nejake-more nejaky-pristav)
   deleted: (nachazi-se namornik nejake-more)
   added: (nachazi-se namornik nejaky-pristav)
   goals met: 0 of 3
20. (seznamil-se-s-paseraky namornik nejaka-zlata-cihla nejaky-pristav)
   added: (ma-znamosti-s-paseraky namornik)
   goals met: 0 of 3
21. (sel namornik nejaky-pristav nejake-mesto)
   deleted: (nachazi-se namornik nejaky-pristav)
   added: (nachazi-se namornik nejake-mesto)
   goals met: 0 of 3
22. (sel namornik nejake-mesto nejaka-akademie)
   deleted: (nachazi-se namornik nejake-mesto)
   added: (nachazi-se namornik nejaka-akademie)
   goals met: 0 of 3
23. (vystudoval-akademii-a-stal-se-kapitanem namornik nejaka-zlata-mince nejaka-akademie)
   deleted: (vlastni namornik nejaka-zlata-mince)
   added: (je-kapitanem namornik)
   goals met: 0 of 3
24. (stal-se-admiralem namornik nejaka-akademie)
   added: (je-stastny2 namornik) (je-stastny namornik)
   goals met: 1 of 3
25. (sel namornik nejaka-akademie nejake-mesto)
   deleted: (nachazi-se namornik nejaka-akademie)
   added: (nachazi-se namornik nejake-mesto)
   goals met: 1 of 3
26. (venoval-se-verejnym-pracim namornik nejake-mesto)
   deleted: (ma-zaznam-v-rejstriku-trestu namornik)
   added: (je-nameteny namornik)
   goals met: 1 of 3
27. (sehnal-prstynek namornik nejaky-prstynek nejaka-zlata-cihla nejaka-perla)
   deleted: (vlastni namornik nejaka-zlata-cihla) (vlastni namornik nejaka-perla)
   added: (vlastni namornik nejaky-prstynek)
   goals met: 1 of 3
28. (stradal namornik nejake-zlate-zrnko nejaka-zlata-mince nejake-mesto)
   deleted: (vlastni namornik nejake-zlate-zrnko)
   added: (vlastni namornik nejaka-zlata-mince) (ma-dobre-znamosti namornik)
   goals met: 1 of 3
29. (sel namornik nejake-mesto nejaky-pristav)
   deleted: (nachazi-se namornik nejake-mesto)
   added: (nachazi-se namornik nejaky-pristav)
   goals met: 1 of 3
30. (plul namornik nejaka-karavela nejaky-pristav nejaky-majak)
   deleted: (nachazi-se namornik nejaky-pristav)
   added: (nachazi-se namornik nejaky-majak)
   goals met: 1 of 3
31. (donesl-divce-prstynek-a-kvetinu namornik divka nejaka-kvetina nejaky-prstynek nejaky-majak)
   added: (je-zasnoubeny-s-divkou namornik)
   goals met: 1 of 3
32. (plul namornik nejaka-karavela nejaky-majak nejake-more)
   deleted: (nachazi-se namornik nejaky-majak)
   added: (nachazi-se namornik nejake-more)
   goals met: 1 of 3
33. (plul namornik nejaka-karavela nejake-more nejaky-ostrov)
   deleted: (nachazi-se namornik nejake-more)
   added: (nachazi-se namornik nejaky-ostrov)
   goals met: 1 of 3
34. (vybral-skrys namornik nejaky-kokain nejaka-mapa nejaky-ostrov)
   deleted: (vlastni namornik nejaka-mapa)
   added: (vlastni namornik nejaky-kokain)
   goals met: 1 of 3
35. (ozenil-se namornik nejaka-kvetina nejaky-prstynek nejaky-ostrov)
   added: (je-stastny1 namornik)
   goals met: 2 of 3
36. (plul namornik nejaka-karavela nejaky-ostrov nejake-more)
   deleted: (nachazi-se namornik nejaky-ostrov)
   added: (nachazi-se namornik nejake-more)
   goals met: 2 of 3
37. (porazil-piraty namornik nejake-more nejaka-karavela nejaky-clun nejaka-fregata nejake-zlate-zrnko nejaka-zlata-mince nejaka-zlata-cihla)
   added: (vlastni namornik nejake-zlate-zrnko) (vlastni namornik nejaka-zlata-cihla)
   goals met: 2 of 3
38. (plul namornik nejaka-karavela nejake-more nejaky-pristav)
   deleted: (nachazi-se namornik nejake-more)
   added: (nachazi-se namornik nejaky-pristav)
   goals met: 2 of 3
39. (sel namornik nejaky-pristav nejaka-hospoda)
   deleted: (nachazi-se namornik nejaky-pristav)
   added: (nachazi-se namornik nejaka-hospoda)
   goals met: 2 of 3
40. (koupil-alkohol namornik nejaky-alkohol nejake-zlate-zrnko nejaka-hospoda)
   deleted: (vlastni namornik nejake-zlate-zrnko)
   added: (vlastni namornik nejaky-alkohol)
   goals met: 2 of 3
41. (opil-se namornik nejaky-alkohol)
   deleted: (je-nameteny namornik) (vlastni namornik nejaky-alkohol)
   added: (je-opily namornik)
   goals met: 2 of 3
42. (zaplatil-rundu namornik nejaka-zlata-mince nejaka-hospoda nejaky-alkohol)
   deleted: (vlastni namornik nejaka-zlata-mince)
   added: (vlastni namornik nejaky-alkohol)
   goals met: 2 of 3
43. (opil-se-a-ziskal-alkozavislost namornik nejaky-alkohol)
   deleted: (je-opily namornik) (vlastni namornik nejaky-alkohol)
   added: (je-zavisly-na-alkoholu namornik)
   goals met: 2 of 3
44. (dal-se-na-kokain namornik nejaky-kokain nejaka-zlata-cihla nejaka-fregata)
   added: (je-stastny3 namornik)
   goals met: 3 of 3
